[
    {
        "_id": "6249def09a6868c97b1cab90",
        "description": "For all the simplicity of its setup, Milkman is a richly complex portrayal of a besieged community and its traumatized citizens, of lives lived within many concentric circles of oppression ... Among Burns singular strengths as a writer is her ability to address the topics of trauma and tyranny with a playfulness that somehow never diminishes the sense of her absolute seriousness ... The book’s long sentences, its penchant for the exhaustive, can at times be challenging, and there were stretches where I found its uncanny energies stagnated for too long. But it also seems clear to me that these insistent strategies are in service of the books mood of total claustrophobia, and that they contribute to, rather than diminish, its overall effectiveness ... There is a pulsating menace at the heart of the book, of which the title character is an uncannily indeterminate avatar, but also a deep sadness at the human cost of conflict ... For all the darkness of the world it illuminates, Milkman is as strange and variegated and brilliant as a northern sunset. You just have to turn your face toward it, and give it your full attention.",
        "ratings": "4",
        "picture": "https://ibb.co/Vx3SV8H",
        "name": "MARK OCONNELL",
        "date": "12/15/2019"
    },
    {
        "_id": "6249def08223a4740000f2b8",
        "description": "Burnss agenda is not to unpack the dreary tribal squabbles that so characterised Troubles-era Northern Ireland; rather she is working in an altogether more interesting milieu, seeking answers to the big questions about identity, love, enlightenment and the meaning of life for a young woman on the verge of adulthood ... in its intricate domestic study of a disparate family there are agreeable echoes of Chekov, Tolstoy and Turgenev ... it is an impressive, wordy, often funny book and confirms Anna Burns as one of our rising literary stars",
        "ratings": "4",
        "picture": "http://placehold.it/32x32",
        "name": "ADRIAN MCKINTY",
        "date": "01/25/2019"
    },
    {
        "_id": "6249def02988108b2465f8ae",
        "description": "it’s clearly part of Burns’s project in Milkman to redescribe the Troubles without using such terms as ‘the Troubles’, ‘Britain’ and ‘Ireland’, ‘Protestant’ and ‘Catholic’, ‘RUC’ and ‘British army’ and ‘IRA’. On the other, the narrator’s mad, first-principles language, with its abundance of phrases in inverted commas and sudden changes of register, is also used to describe the inner world of a young woman ... It’s a brilliant rhetorical balancing act, and the narrator can be very funny ... What’s extraordinary about all this, though easy to overlook on a first reading, at least until the final stretch, is the density and tightness of the plotting behind the narrator’s apparently rambling performance ... What’s more, the comic unfolding of the plot runs counter to the narrator’s pinched sense of what can and can’t be said and done in her neighbourhood, and, after a chilling final encounter with the milkman, there’s a darkly happy ending ... as a reader you feel you’ve earned the novel’s more optimistic resolution, and that Burns, with her wild sentences and her immense writerly discipline, has too.",
        "ratings": "2",
        "picture": "http://placehold.it/32x32",
        "name": "CHRISTOPHER TAYLER",
        "date": "06/12/2020"
    },
    {
        "_id": "6249def0c8d782d1733c005b",
        "description": "A useful point of comparison, doubling as a compliment and a caveat, is with Samuel Beckett. Next to nothing happens in Milkman, yet Ms. Burns, like the novel’s many gossips, constructs a monument from middle sister’s digressive, repetitive, idle, sardonic, amused and amusing talk. The story doesn’t advance so much as thicken, reaching a critical mass of absurdist misapprehensions. The bright thread of exasperated sarcasm that runs through the narrative compensates for its wheel-spinning. Ms. Burns, while frank about the brutality of the state forces, is refreshingly disrespectful to the insurgents.",
        "ratings": "3",
        "picture": "http://placehold.it/32x32",
        "name": "SAM SACKS",
        "date": "11/28/2021"
    },
    {
        "_id": "6249def04a0a1d6107face4d",
        "description": "Burns’s genius lies in entirely renouncing the classic truth-discovery plot. Detective work—even at its most Miss Marple, most feminine and unassuming—is completely unavailable to middle sister ... There were times reading Milkman when I thought I would get a cramp from laughing, but it is hard to do justice to the book’s humor in a review because much of it comes from the sheer length of characters’ speeches and of grown-up middle sister’s own free-wheeling, digressive, retrospective narration ... What’s exhilarating about reading ma is that, although we know she would not use words such as 'vermifuge,' by heaping 'vermifuge' on top of 'do I have to spell it out?,' Burns gets us right on board with the shock and disapproval, even while we are laughing ... The novel is carried by the extraordinary dynamism of middle sister’s voice, full of syntactically vertiginous constructions and new coinages.",
        "ratings": "5",
        "picture": "http://placehold.it/32x32",
        "name": "CLAIR WILLS",
        "date": "12/21/2018"
    },
    {
        "_id": "6249def048bce3e89df69e3c",
        "description": "There’s nothing like a striking beginning, and 'The day Somebody McSomebody put a gun to my breast and called me a cat and threatened to shoot me was the same day the milkman died' isn’t bad ... an eccentric and oddly beguiling novel ... what makes it memorable is the funny, alienated, common-sensical voice of middle sister.",
        "ratings": "4",
        "picture": "http://placehold.it/32x32",
        "name": "PHIL BAKER",
        "date": "04/11/2022"
    }
]